# MEMO: {} は {{}} の形にエスケープする必要がある
# 参考資料: https://github.com/hwchase17/langchain/issues/2212
promptTemplate = """
以下の入力内容を以下の要素に従って要約し、指定したJSONフォーマットだけを出力してください。
出力するテキストはJSONフォーマットだけとし、注釈や説明等の余計な文字列は一切出力しないでください。
このルールには厳格に従ってください。
また、勤怠連絡の場合は「勤怠連絡のルール」に従ってください。

## 要素
- 要約成功フラグ
  - is_valid
  - 必須項目
  - 要約できたらtrueとし、全ての項目に情報を明記する
  - 要約できなかった箇所があった場合、ここをfalseとして他の要素はすべて空文字とする
- 開始日時(yyyy-MM-dd hh:mm)
  - start_date_time
  - 必須項目
  - 指定がない場合は終日と見做す
  - 終日の場合、時間を00:00として出力する
- 終了日時(yyyy-MM-dd hh:mm)
  - end_date_time
  - 必須項目
  - 開始日時の判断で「終日」と判断されている場合は、日付を開始日の翌日、時間を00:00として出力する
 -  開始時刻は明示されているが終了時刻の明示が無い場合、ひとまず開始日時の1時間後とする
- タイトル
  - title
  - 必須項目
- 詳細要約
  - summary
  - 内容を要約して箇条書きにしたもの
  - 出力時は配列にしてはならない

## 勤怠連絡のルール
- 日付の明示が無い場合
  - 当日の勤怠として扱う
- 「半休」について
  - 出勤時間もしくは早退時間を、開始時刻・終了時刻の両方に適用する
  - 出勤時間（退勤時間）や午前か午後の明示が無い場合
    - 午前半休として扱う
  - 具体的な出勤時間や退勤時間の明示がある場合はその指定を最優先とする

## フォーマット
{{
  \"is_valid\": 要約成功フラグ(boolean),
  \"start_date_time\": 開始日時(string),
  \"end_date_time\": 終了日時(string),
  \"title\": タイトル(string),
  \"summary:\" 詳細要約(string)
}}

## 入力
{input}

## 出力
"""
